'''
PyQt 是一个用于创建桌面应用程序的 Python 框架，它是基于 Qt 库的 Python 绑定。用于开发图形用
户界面、网络应用、数据库驱动和其他各种应用程序。PyQt 提供了对 Qt 库的 Python 封装，使得开发
者可以使用 Python 编程语言来利用 Qt 的强大功能。
'''
#pyqt5是什么,最新版本是pyqt6
'''
《1》PyQt5 是 Riverbank Computing 开发的 GUI 小部件工具包的最新版本。
《2》它是 Qt 的 Python 接口，是最强大和流行的跨平台 GUI 库之一。
《3》PyQt5 是 Python 编程语言和 Qt 库的混合体。 所以说PyQt5就是Python的图形界面开发库。
《4》程序的用户交互界面，称为UI（User interface）。通过使用PyQt5库，我们可以快速制作自己的小
工具。
'''
#pyqt5的优势
'''
文档齐全
稳定性高:C++开发,底层使用Qt库
生态支持
免费开源:双开源协议,GPL,商业许可证


《1》文档齐全：PyQt是对Qt库的一个绑定，且保持了Qt库原有的API，因此PyQt除了可以使用自己的文档，
也几乎可以通用Qt的文档。
《2》稳定性高：PyQt使用C++开发，底层使用Qt库，因此比纯Python的GUI库更加稳定可靠。PyQt支持跨
平台开发，而且保持着和Qt库的同步更新，因此在不同的操作系统和Python版本下都有良好的兼容性。
《3》生态支持：PyQt拥有一个活跃的社区和丰富的第三方库支持，可以方便地实现各种功能，如数据库操
作、图形绘制、图像处理等。另外，PyQt作者也开发了一些扩展包，如PyQtChart、
PyQtDataVisualization等，使得绘制图表和数据可视化变得更加容易。
《4》开源免费：PyQt5采用双开源协议，第一种采用GPL（GNU General Public License）协议，开发
人员可以免费使用PyQt5（但你的应用也必须遵循GPL协议即源代码公开），第二种商业许可证，如果你不想
公开你的源码，或者不希望遵守GPL协议，那么你可以购买PyQt5的商业许可证，即可不公开程序源码。这使
得PyQt在开源界和商业界都有广泛的应用和支持。
'''
#PYQT5的应用领域
'''
游戏开发
自动化和控制系统
桌面应用程序
嵌入式开发
《1》游戏开发，虽然 PyQT5 主要用于创建用户界面，但它也可以用于游戏开发，尤其是那些注重故事叙述
和角色交互的图形冒险游戏。
《2》自动化和控制系统，PyQT5 可以用于创建监控和控制系统，它提供了对信号和槽机制的支持，这有助于
实现复杂的事件处理逻辑。
《3》桌面应用程序，它提供了丰富的控件和组件，以及强大的布局管理器，使得开发者可以轻松地创建具有复
杂界面的应用程序。
《4》嵌入式开发，PyQT5 可以用于创建定制的硬件设备上的应用程序。
'''

