'''
2.1 协议的概念
协议是指一系列规则和标准，这些规则定义了数据如何在网络上从一个设备传输到另一个设备。协议确
保了不同计算机和网络设备之间能够理解和处理传输的数据。
2.2 协议的作用
1. 数据封装：协议定义了数据应该如何封装，以便在不同的网络层之间传递。例如，TCP协议会在数
据包前加上TCP头部信息。
2. 寻址和路由：协议规定了如何为数据包添加地址信息，以及数据包在网络中如何从源地址传送到目
的地址。例如，IP协议负责将数据包发送到正确的目的地。
3. 数据传输：协议定义了数据的传输方式，包括数据的发送和接收机制。例如，TCP协议提供了可靠
的、面向连接的数据传输。
4. 错误检测和纠正：许多协议包含了错误检测和纠正机制，以确保数据的完整性和可靠性。例如，校
验和（Checksum）是用于检测数据在传输过程中是否发生错误的一种方法。
5. 流量控制和拥塞控制：协议可以管理网络中的数据流量，以防止网络拥塞。例如，TCP协议中的窗
口大小调整就是流量控制的一种方法。
6. 会话管理：协议可以管理网络连接的建立、维护和终止。例如，HTTP协议在客户端和服务器之间
建立会话，以交换网页请求和响应。
7. 安全性：一些协议提供了安全机制，如加密和认证，以确保数据传输的安全性。例如，SSL/TLS协
议用于在传输层上加密数据。

'''
