"""
1 面向过程与面向对象
2 类的定义与创建对象
3 类的封装 \
4 类的继承   }- =>特性
5 类的多态 /
"""

"""
面向过程编程（POP）：是一种以过程为中心的编程思想，它将程序看作一系列的命令、函数或过程的集合，
主要关注解决问题的步骤和过程。在面向过程编程中，程序被划分为一系列的函数，每个函数负责完成一个特定的任务。
数据在整个程序都是自由流动的，任何函数都可以去访问和修改数据。(逻辑简单的问题用这种)(简单的数学计算程序,大量的数据批处理,快速处理文本数据脚本等)

面向对象编程（OOP）：将程序看作一系列对象的集合，每个对象都是独立的个体，包含数据（属性）和操作这些数据的方法（行为）。
这些对象之间通过发送消息（调用方法）来相互作用，共同解决某种问题。(用的多一点)(适合开发具有多种功能,结构复杂的,抽象的模块化程序:如游戏开发)
"""
"""
面向过程的优点:
简单直观
性能高效
代码简洁

面向过程的缺点:
不易维护
不易拓展
代码重用性低
"""


"""
面向对象的优点:
模块化
安全性高
代码重用性高

面向对象的缺点
学习难度大
性能开销大(对象要占用内存空间)
调试困难(很难把握到哪一部分出问题)
"""


"""
从本质上来说，
面向过程与面向对象都是用来解决问题的，
只是看待问题的角度
不同：
面向过程更多的是注重解决问题的步骤，编程时会详细规划和控制程序的流程，程序按照步骤执行下去，问题就能解决。

面向对象更多的是注重对象之间的交互，将问题抽象为类，然后创造对象，通过对象调用方法，从而协同解决问题。
"""

